<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
class PostsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $images = array('1.png','2.png','3.png','4.png','5.png','6.png','7.png','8.png','9.png');
        $titles = array('დონალდ ტრამპის ვებ გვერდი გატყდა','Windows– ის ახალი RAT კონტროლი შესაძლებელია Telegram არხის საშუალებით დაწვრილებითი','ბრიტანეთი GRU ადანაშაულებს კიბერ შეტევებში სამხრეთ კორეის ოლიმპიადაზე','Google -მა გამოააშკარავა კიბერ შეტევის სიძლიერე','ინტერნეტში 18 კომპანიის მონაცემთა ბაზა გაიჟონა, რომელიც დაახლოებით 386 მილიონ ჩანაწერს შეიცავს','Iphone-ის უსაფრთხოების სისტემაში გამოუსწორებელი “ბაგი” აღმოაჩინეს','დარქნეტში CloudFlare-დან IP-ადრეს ბაზა გაიჟონა , რომელიც დაახლოებით 3 მილიონ ნამდვილ IP-ადრესს შეიცავდა.','Android-ტროიანა Cerberus-ის დეველოპერები აპირებენ გაყიდონ მთელი თავიანთი პროექტი.','კიბერ ჟურნალი / Cyber Journal');
        $texts = array('ამერიკის პრეზიდენტის ოფიციალურ ვებ-გვერდზე კიბერ შეტევა განხორციელდა, სადაც ფედერალურმა სამსახურებმა ვითარება დროულად აღმოფხვრეს.','3xp0rt ფსევდონიმის მქონე მკვლევარმა აღმოაჩინა ახალი დისტანციური წვდომის Trojan (RAT), რომელიც რეკლამირებულია რუსულენოვან ფარულ ჰაკერების ფორუმებზე. მავნე პროგრამა, სახელწოდებით T-RAT, 45 დოლარად იყიდება და მისი მთავარი უპირატესობაა ინფიცირებული სისტემების კონტროლის შესაძლებლობა Telegram არხის საშუალებით (და არა web-ადმინ პანელის საშუალებით).','"GRU კიბერ დანაყოფმა" 2018 წლის თამაშების გახსნის ცერემონიალზე სავარაუდოდ სცადა "შენიღბვა ჩრდილოეთ კორეელ და ჩინელ ჰაკერებად". ”მისი მოქმედებები მიმართული იყო მაუწყებლების, სათხილამურო კურორტის, ოფიციალური პირებისა და თამაშების სპონსორების წინააღმდეგ”, - დასძინა მინისტრმა.','ამ კვირაში Google Cloud– ის გუნდმა ისაუბრა მანამდე უცნობი DDoS შეტევის შესახებ, რომლის მიზანიც იყო Google– ის სერვისი 2017 წლის სექტემბერში და მიაღწია 2,54 ტბ / წმ – ს, რაც მას ყველაზე ძლიერ დაფიქსირებულ შეტევად აქცევს.','კიბერდამნაშავე ან კიბერდამნაშავეთა დაჯგუფმ ShinyHunters-ს, ინტერნეტ ფორუმებს ავსებს უფასო მონაცემთა ბაზებით. ამა წლის 21 ივლისიდან დაჯგუფებამ დაიწყო მონაცემთა ბაზების გამოქვეყნება ერთ-ერთ დარქნეტის სავაჭრო პლატფორმაზე. ის შეიცავდა დაახლოებით 386 მილიონ ჩანაწერს, რომელიც 18 კომპანიიდან იქნა მოპარული.','გატეხვისთვის გამოიყენება ექსპლოიტ Checkm8, რომელსაც შეუძლია გვერდი აუაროს ავტომატურ ბლოკირებას პაროლის 10 ჯერ არასწორად შეყვანისას.','დარქნეტში კიბერდამნაშაავეებმა მონაცემთა ბაზა გამოაქვენეს სერვის CloudFare-დან, უზრეუნველყოფის მომსახურებები CDN, დაცვა DDoS-შეტევებისგან, უსაფრთხო წვდომა სერვერის რესურსებთან DNS. სერვისის მომხარებლები ძირითადად იყვნენ უკრაინული კომპანიები, მათ შორის სახელმწიფო ორგანიზაციები. ინფორმაციის გაჟონვის შესახებ იტყობინება უკრაინის უსაფრთხოების სამსახური.','ვაჭრობა განხორციელდება აუქციონის სახით და საწყისი ფასი იქნება 50 000$, ხოლო 100 000$-ად ვაჭრობის გარეშედაც იქნება პროექტის შეძენა შესაძლებელი. მყიდველი მიიღებს წვდომას ტროიანას ორიგინალურ კოდთან, აპლიკაციასთან, მოდულთან, ადმინ პანელთან, სერვერთან, აქტიურ და პოტენციალურ კლიენტთა სიასთან, დაყენების მართვასა და სკრიპთან, რომელიც აუცილებელია ყველა კომპონენტის მოწესრიგებული მუშაობისათვის.','კიბერ უსაფრთხოების ჯგუფი №1 ელ-ჟურნალი, ინფორმაციული და კიბერ უსაფრთხოება, ქსელური და საინფორმაციო ტექნოლოგიები, კომპიუტერული და ციფრული სამყარო.');

        for ($i=0; $i < 9 ; $i++) { 
        	DB::table('create_posts')->insert([
        		'image'=>$images[$i],
        		'title'=>$titles[$i],
        		'text'=>$texts[$i]
        	]);
        }
    }
}
